In [ ]:
#Proprietary content. Â©Great Learning. All Rights Reserved. Unauthorized use or distribution prohibited

In [1]:
#Creating Series Object

In [2]:
import pandas as pd
import numpy as np
import seaborn as sns

myList = [5.4,6,7.3,2,1.6,89,23]
myArray = np.array(myList)
print(myList)
print(myArray)

[5.4, 6, 7.3, 2, 1.6, 89, 23]
[ 5.4  6.   7.3  2.   1.6 89.  23. ]

In [10]:
mySeries1 = pd.Series(data = myList)
print(mySeries1)
mySeries2 = pd.Series(data = myArray)
print(mySeries2) #Showing different values for me, as compared to the tutorial video
print(' ')
print(mySeries1[2])

0     5.4
1     6.0
2     7.3
3     2.0
4     1.6
5    89.0
6    23.0
dtype: float64
0     5.4
1     6.0
2     7.3
3     2.0
4     1.6
5    89.0
6    23.0
dtype: float64

7.3

In [12]:
myLabels = ['first','second','third','fourth','fifth','sixth','seventh']
mySeries3 = pd.Series(data = myList,index = myLabels)
print(mySeries3)

first       5.4
second      6.0
third       7.3
fourth      2.0
fifth       1.6
sixth      89.0
seventh    23.0
dtype: float64

In [17]:
mySeries4 = pd.Series(myList,myLabels)
print(mySeries4,end="\n\n")
print(mySeries4['second'])

first       5.4
second      6.0
third       7.3
fourth      2.0
fifth       1.6
sixth      89.0
seventh    23.0
dtype: float64

6.0

In [25]:
mySeries5 = pd.Series([5.5,1.1,8.8,1.6],['first','third','second','fourth'])
print(mySeries4)
print(mySeries5,end = "\n\n")
print(mySeries5+mySeries4)

first       5.4
second      6.0
third       7.3
fourth      2.0
fifth       1.6
sixth      89.0
seventh    23.0
dtype: float64
first     5.5
third     1.1
second    8.8
fourth    1.6
dtype: float64

fifth       NaN
first      10.9
fourth      3.6
second     14.8
seventh     NaN
sixth       NaN
third       8.4
dtype: float64

In [39]:
#creating a dataframe by concatenating series
df1 = pd.concat([mySeries4,mySeries5],axis=1,sort=False)
df1

            0    1
first     5.4  5.5
second    6.0  8.8
third     7.3  1.1
fourth    2.0  1.6
fifth     1.6  NaN
sixth    89.0  NaN
seventh  23.0  NaN

In [34]:
df3 = pd.DataFrame(np.random.randn(5,5),index=['first row','second row','third row','fourth row','fifth row'],
columns=['first col','second col','third col','fourth col','fifth col'])
df3

            first col  second col  third col  fourth col  fifth col
first row   -1.277120   -0.911097   0.815176   -0.736670   1.166526
second row  -0.722926   -1.024706   0.049264   -0.743895   1.330774
third row    0.078718   -1.416140   0.371443    0.779829   0.360530
fourth row   2.084999    0.660800   1.464659    0.117162  -0.339901
fifth row   -0.129724   -1.074525  -0.757926   -1.850759  -1.246636

In [42]:
print(df3['second col'])#this can be used only to access columns,not rows
print('')
df3[['third col','first col']]

first row    -0.911097
second row   -1.024706
third row    -1.416140
fourth row    0.660800
fifth row    -1.074525
Name: second col, dtype: float64

            third col  first col
first row    0.815176  -1.277120
second row   0.049264  -0.722926
third row    0.371443   0.078718
fourth row   1.464659   2.084999
fifth row   -0.757926  -0.129724

In [43]:
df3.loc['fourth row']#used to fetch values from row in the dataframe

first col     2.084999
second col    0.660800
third col     1.464659
fourth col    0.117162
fifth col    -0.339901
Name: fourth row, dtype: float64

In [52]:
print(df3.iloc[2])#fetches values using index
print('')
df3.loc[['fourth row','fifth row'],['third col','first col']]

first col     0.078718
second col   -1.416140
third col     0.371443
fourth col    0.779829
fifth col     0.360530
Name: third row, dtype: float64

            third col  first col
fourth row   1.464659   2.084999
fifth row   -0.757926  -0.129724

In [53]:
df3>0

            first col  second col  third col  fourth col  fifth col
first row       False       False       True       False       True
second row      False       False       True       False       True
third row        True       False       True        True       True
fourth row       True        True       True        True      False
fifth row       False       False      False       False      False

In [54]:
print(df3[df3>0]) #gives NaN for all negative values, returns all values that are True

            first col  second col  third col  fourth col  fifth col
first row         NaN         NaN   0.815176         NaN   1.166526
second row        NaN         NaN   0.049264         NaN   1.330774
third row    0.078718         NaN   0.371443    0.779829   0.360530
fourth row   2.084999      0.6608   1.464659    0.117162        NaN
fifth row         NaN         NaN        NaN         NaN        NaN

In [58]:
df3['sixth col'] = np.random.randn(5,1)
df3

            first col  second col  third col  fourth col  fifth col  sixth col
first row   -1.277120   -0.911097   0.815176   -0.736670   1.166526  -1.057375
second row  -0.722926   -1.024706   0.049264   -0.743895   1.330774   0.094447
third row    0.078718   -1.416140   0.371443    0.779829   0.360530  -0.464638
fourth row   2.084999    0.660800   1.464659    0.117162  -0.339901   1.445109
fifth row   -0.129724   -1.074525  -0.757926   -1.850759  -1.246636  -0.423029

In [73]:
df3.drop('first col',axis=1) #This won't impact dataframe df3, as the value isn't assigned to other dataframe & inplace value also isn't set
df3
df3.drop('first col',axis=1,inplace=True)
print(df3)

            second col  third col  fourth col  fifth col  sixth col
first row    -0.911097   0.815176   -0.736670   1.166526  -1.057375
second row   -1.024706   0.049264   -0.743895   1.330774   0.094447
third row    -1.416140   0.371443    0.779829   0.360530  -0.464638
fourth row    0.660800   1.464659    0.117162  -0.339901   1.445109
fifth row    -1.074525  -0.757926   -1.850759  -1.246636  -0.423029

In [72]:
df4 = df3.drop('first col',axis=1)
df4

            second col  third col  fourth col  fifth col  sixth col
first row    -0.911097   0.815176   -0.736670   1.166526  -1.057375
second row   -1.024706   0.049264   -0.743895   1.330774   0.094447
third row    -1.416140   0.371443    0.779829   0.360530  -0.464638
fourth row    0.660800   1.464659    0.117162  -0.339901   1.445109
fifth row    -1.074525  -0.757926   -1.850759  -1.246636  -0.423029

In [65]:
df5 = df3.drop('first row',axis=0)
print(df5)
print('')
df5.reset_index()

            first col  second col  third col  fourth col  fifth col  sixth col
second row  -0.722926   -1.024706   0.049264   -0.743895   1.330774   0.094447
third row    0.078718   -1.416140   0.371443    0.779829   0.360530  -0.464638
fourth row   2.084999    0.660800   1.464659    0.117162  -0.339901   1.445109
fifth row   -0.129724   -1.074525  -0.757926   -1.850759  -1.246636  -0.423029

,index,first col,second col,third col,fourth col,fifth col,sixth col
0,second row,-0.722926,-1.024706,0.049264,-0.743895,1.330774,0.094447
1,third row,0.078718,-1.416140,0.371443,0.779829,0.360530,-0.464638
2,fourth row,2.084999,0.660800,1.464659,0.117162,-0.339901,1.445109
3,fifth row,-0.129724,-1.074525,-0.757926,-1.850759,-1.246636,-0.423029

In [66]:
df5.reset_index(inplace=True)
df5

,index,first col,second col,third col,fourth col,fifth col,sixth col
0,second row,-0.722926,-1.024706,0.049264,-0.743895,1.330774,0.094447
1,third row,0.078718,-1.416140,0.371443,0.779829,0.360530,-0.464638
2,fourth row,2.084999,0.660800,1.464659,0.117162,-0.339901,1.445109
3,fifth row,-0.129724,-1.074525,-0.757926,-1.850759,-1.246636,-0.423029

In [67]:
df5['new name'] = ['this','is','the','row']
df5

,index,first col,second col,third col,fourth col,fifth col,sixth col,new name
0,second row,-0.722926,-1.024706,0.049264,-0.743895,1.330774,0.094447,this
1,third row,0.078718,-1.416140,0.371443,0.779829,0.360530,-0.464638,is
2,fourth row,2.084999,0.660800,1.464659,0.117162,-0.339901,1.445109,the
3,fifth row,-0.129724,-1.074525,-0.757926,-1.850759,-1.246636,-0.423029,row

In [69]:
df5.set_index('new name',inplace=True)
df5

,index,first col,second col,third col,fourth col,fifth col,sixth col
new name,,,,,,,
this,second row,-0.722926,-1.024706,0.049264,-0.743895,1.330774,0.094447
is,third row,0.078718,-1.416140,0.371443,0.779829,0.360530,-0.464638
the,fourth row,2.084999,0.660800,1.464659,0.117162,-0.339901,1.445109
row,fifth row,-0.129724,-1.074525,-0.757926,-1.850759,-1.246636,-0.423029

In [2]:
import pandas as pd
s1=pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
type(s1)

pandas.core.series.Series

In [ ]:
#Changing Index

In [6]:
import pandas as pd
s1=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [7]:
#Series from dictionary

In [8]:
import pandas as pd
pd.Series({'a':10,'b':20,'c':30})

a    10
b    20
c    30
dtype: int64

In [192]:
import pandas as pd
# pd.Series({'a':10,'b':20,'c':30},index=['b','c','d','a'])
pd.Series({'a':10.0,'b':20.0,'c':'30.0'},index=['b','c','d','a'])

b      20
c    30.0
d     NaN
a      10
dtype: object

In [10]:
#Creating a dataframe

In [11]:
import pandas as pd

pd.DataFrame({"Name":['Bob','Sam','Anne'],"Marks":[76,25,92]})

   Name  Marks
0   Bob     76
1   Sam     25
2  Anne     92

In [5]:
#Importing dataframe
import seaborn as sns

In [6]:
df= sns.load_dataset('iris')
# iris=pd.read_csv('iris.csv')

In [7]:
#Having a glance at first 5 rows

In [8]:
iris.head()

NameError: name 'iris' is not defined

In [ ]:
#Having a glance at last 5 rows

In [16]:
iris.tail()

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [18]:
iris.shape

(150, 5)

In [19]:
iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [ ]:
#Finding Minimum value

In [20]:
iris.min()

Sepal.Length       4.3
Sepal.Width          2
Petal.Length         1
Petal.Width        0.1
Species         setosa
dtype: object

In [ ]:
#Finding Maximum value

In [21]:
iris.max()

Sepal.Length          7.9
Sepal.Width           4.4
Petal.Length          6.9
Petal.Width           2.5
Species         virginica
dtype: object

In [22]:
#loc and iloc

In [23]:
iris.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [3]:
iris.iloc[0:3,0:2]

   Sepal.Length  Sepal.Width
0           5.1          3.5
1           4.9          3.0
2           4.7          3.2

In [4]:
iris.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [5]:
iris.loc[0:3,("Sepal.Length","Petal.Length")]

   Sepal.Length  Petal.Length
0           5.1           1.4
1           4.9           1.4
2           4.7           1.3
3           4.6           1.5

In [1]:
import pandas as pd

iris=pd.read_csv('iris.csv')

In [2]:
iris.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [5]:
iris.drop([1,2,3],axis=0)

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
5             5.4          3.9           1.7          0.4     setosa
6             4.6          3.4           1.4          0.3     setosa
7             5.0          3.4           1.5          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[147 rows x 5 columns]

In [6]:
iris.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [83]:
df7 = pd.DataFrame({"customer":['101','102','103','104'],
                   'category':['cat1','cat2','cat3','cat3'],
                   'important':['yes','no','yes','no'],
                   'sales': [123,45,67,54]},index=[0,1,2,3])
df8 = pd.DataFrame({"customer":['101','102','107','109'],
                   'color':['red','blue','pink','black'],
                   'distance':[12,45,34,63],
                   'sales': [123,452,657,584]},index=[4,5,6,7])
df8

  customer  color  distance  sales
4      101    red        12    123
5      102   blue        45    452
6      107   pink        34    657
7      109  black        63    584

In [84]:
pd.concat([df7,df8],axis=1, sort=True)

  customer category important  sales customer  color  distance  sales
0      101     cat1       yes  123.0      NaN    NaN       NaN    NaN
1      102     cat2        no   45.0      NaN    NaN       NaN    NaN
2      103     cat3       yes   67.0      NaN    NaN       NaN    NaN
3      104     cat3        no   54.0      NaN    NaN       NaN    NaN
4      NaN      NaN       NaN    NaN      101    red      12.0  123.0
5      NaN      NaN       NaN    NaN      102   blue      45.0  452.0
6      NaN      NaN       NaN    NaN      107   pink      34.0  657.0
7      NaN      NaN       NaN    NaN      109  black      63.0  584.0

In [90]:
# Merge and Join
pd.merge(df7,df8,how='inner',on='customer')
pd.merge(df7,df8,how='outer',on='customer')
pd.merge(df7,df8,how='left',on='customer')
pd.merge(df7,df8,how='right',on='customer')

  customer category important  sales_x color  distance  sales_y
0      101     cat1       yes      123   red      12.0    123.0
1      102     cat2        no       45  blue      45.0    452.0
2      103     cat3       yes       67   NaN       NaN      NaN
3      104     cat3        no       54   NaN       NaN      NaN

In [94]:
df9 = pd.DataFrame({'Q1': [102,105,106],
                   'Q2': [204,208,201]},
                   index=['I0','I1','I2'])

df10 = pd.DataFrame({'Q3':[301,308,306],
                     'Q4':[406,409,403]},
                    index=['I0','I1','I3'])

In [99]:
df9.join(df10,how='outer')

       Q1     Q2     Q3     Q4
I0  102.0  204.0  301.0  406.0
I1  105.0  208.0  308.0  409.0
I2  106.0  201.0    NaN    NaN
I3    NaN    NaN  306.0  403.0

In [100]:
df9.join(df10,how='inner')

     Q1   Q2   Q3   Q4
I0  102  204  301  406
I1  105  208  308  409

In [101]:
df9.join(df10,how='left')

     Q1   Q2     Q3     Q4
I0  102  204  301.0  406.0
I1  105  208  308.0  409.0
I2  106  201    NaN    NaN

In [103]:
df8['color'].unique()

array(['red', 'blue', 'pink', 'black'], dtype=object)

In [104]:
df8['color'].value_counts()

blue     1
black    1
pink     1
red      1
Name: color, dtype: int64

In [106]:
df9.mean()

Q1    104.333333
Q2    204.333333
dtype: float64

In [109]:
df8.columns
df8

  customer  color  distance  sales
4      101    red        12    123
5      102   blue        45    452
6      107   pink        34    657
7      109  black        63    584

In [114]:
new_df = df8[(df8['customer']!='109') & (df8['color']!='pink')]
new_df

  customer color  distance  sales
4      101   red        12    123
5      102  blue        45    452

In [118]:
print(df8['sales'].std()) #std(),min(),max(),sum()
print(df8['distance'].min())

236.41347959313433
12

In [119]:
def profit(s):
    return s*0.5

In [120]:
df8['sales'].apply(profit)

4     61.5
5    226.0
6    328.5
7    292.0
Name: sales, dtype: float64

In [123]:
df8['color'].apply(len)
df8

  customer  color  distance  sales
4      101    red        12    123
5      102   blue        45    452
6      107   pink        34    657
7      109  black        63    584

In [125]:
df11 = df8[['distance','sales']]
df11.applymap(profit) #applymap only works on Dataframe & only works entry by entry, o/p is always another dataframe
df11

   distance  sales
4        12    123
5        45    452
6        34    657
7        63    584

In [128]:
def col_sum(co):
    return sum(co)
df11.apply(col_sum) #applymap only works entry by entry, not on complete series at a time

distance     154
sales       1816
dtype: int64

In [129]:
del df8['color']
df8

  customer  distance  sales
4      101        12    123
5      102        45    452
6      107        34    657
7      109        63    584

In [130]:
df8.index

Int64Index([4, 5, 6, 7], dtype='int64')

In [136]:
df8.sort_values(by='distance')
df8.sort_values(by='distance',inplace=True)
df8

  customer  distance  sales
4      101        12    123
6      107        34    657
5      102        45    452
7      109        63    584

In [12]:
mydict= {'customer': ['Cust1','Cust1','Cust2','Cust2','Cust3','Cust3'],
        'product1':[1.1,2.2,3.3,4.4,5.5,6.6],
        'product2':[3.6,4.2,8.9,6.3,1,5]}
df6 = pd.DataFrame(mydict,index=['Purchase1','Purchase2','Purchase3','Purchase4','Purchase5','Purchase6'])
df6

          customer  product1  product2
Purchase1    Cust1       1.1       3.6
Purchase2    Cust1       2.2       4.2
Purchase3    Cust2       3.3       8.9
Purchase4    Cust2       4.4       6.3
Purchase5    Cust3       5.5       1.0
Purchase6    Cust3       6.6       5.0

In [13]:
grouped_data =df6.groupby('customer')
print(grouped_data)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000028136106B80>

In [142]:
grouped_data.describe()
grouped_data.mean()

          product1  product2
customer
Cust1         1.65       3.9
Cust2         3.85       7.6
Cust3         6.05       3.0

In [144]:
df8.to_csv('df8.csv',index=True)

In [146]:
new_df8 = pd.read_csv('df8.csv',index_col=1)#will create 1st column as the index column, new column for index column present
new_df8

          Unnamed: 0  distance  sales
customer
101                4        12    123
107                6        34    657
102                5        45    452
109                7        63    584

In [148]:
df8.to_excel('df8.xlsx',index=False,sheet_name='first sheet') #defaults to original index labels
newer_df8 = pd.read_excel('df8.xlsx',sheet_name='first sheet',index_col=0)
newer_df8

          distance  sales
customer
101             12    123
107             34    657
102             45    452
109             63    584

In [15]:
# test.to_excel('GDP_Dataset.xlsx')
new_test = pd.read_excel('GDP_Dataset.xlsx')
new_test

FileNotFoundError: [Errno 2] No such file or directory: 'GDP_Dataset.xlsx'

In [185]:
print(new_test.index)

RangeIndex(start=0, stop=172, step=1)

In [167]:
print(new_test['Population'].describe())

count    1.720000e+02
mean     4.247352e+07
std      1.532222e+08
min      1.137000e+04
25%      2.211687e+06
50%      8.637852e+06
75%      3.118956e+07
max      1.421022e+09
Name: Population, dtype: float64

In [178]:
new_test['Urban_Population']>(0.9*7305446192)
print(new_test.count(axis=1,level='nt'))
# 6,574,901,572.8

TypeError: Can only count levels on hierarchical columns.

In [177]:
print(new_test['GDP'])

0      12238.000
1       2651.000
2      19485.000
3       1015.000
4        305.000
         ...
167        0.863
168        4.670
169        0.393
170        0.841
171        1.740
Name: GDP, Length: 172, dtype: float64

In [162]:
grpd_test= new_test.groupby('Population_Density')
print(grpd_test)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001D8294ADA30>

In [172]:
# print(new_test['GDP']>2651)
print(new_test.count(axis=1))

0      14
1      14
2      14
3      14
4      14
       ..
167    14
168    14
169    14
170    14
171    14
Length: 172, dtype: int64

In [164]:
print(new_test['Population'>100000000])

TypeError: '>' not supported between instances of 'str' and 'int'

In [165]:
print(new_test['GDP']=250)

SyntaxError: expression cannot contain assignment, perhaps you meant "=="? (<ipython-input-165-9b73a3263044>, line 1)